require 'uri'
require 'cgi'
#
#a= "http://www.darenhui.com/m?ref=ii-060_0&t=product&pid=2262&categoryid=57&id=52"
#
#b = URI::encode(a)
#p URI::encode(a)
#
#p URI::decode(b)
#
#
#b = CGI::escape(a)
#p b




#string = 'feoaigjaeo哈哈/'
#
#p string.scan(/./)[-1]


#require 'date'
#date = Date.new(1970,8,1)
#time = Time.utc(date.year, date.month, date.day)
#p time.to_i


#a = "1.通过实名认证者 2.在某个方面有特殊专长 比如”我是鞋子控“, “我很会搭配”，“我擅长找白菜”等等… 3.通过达人汇官方的的达人认证。 要申请达人认证的童鞋们请在此话题下回复， 达人小精灵将定期进行认证审核。"
#p a.scan(/./)[0, 140].join('')
#
#
#
#p a[0,140]

#a = ""
#
#
#p a[0,200]
#
#p a.empty?
#my_hash = {"黄浦区"=>"2501", "卢湾区"=>"2502","徐汇区"=>"2503","长宁区"=>"2504","静安区"=>"2505","普陀区"=>"2506","闸北区"=>"2507","虹口区"=>"2508","杨浦区"=>"2509","闵行区"=>"2510","宝山区"=>"2511","嘉定区"=>"2512","浦东新区"=>"2513","金山区"=>"2514","松江区"=>"2515",
#    "青浦区"=>"2516","南汇区"=>"2517","奉贤区"=>"2518","崇明县"=>"2519",'东城区'=>'301',"西城区"=>"302","崇文区"=>"303","宣武区"=>"304","朝阳区"=>"305","丰台区"=>"306","石景山区"=>"307","海淀区"=>"308","门头沟区"=>"309","房山区"=>"310","通州区"=>"311","顺义区"=>"312","昌平区"=>"313","大兴区"=>"314","怀柔区"=>"315","平谷区"=>"316",
#    "密云县"=>"317","延庆县"=>"318"}
#p my_hash.invert



#p Time.new
#
#p Time.now
#  a = "sssssssssssss"
#
#  b = a.dup
#  p b
#  a.insert(8, '2')
#  p b


#p ( 1313721419 + 720*3600 - Time.now.to_i )
